In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

C:\Users\egorm\anaconda3\lib\site-packages\scipy\__init__.py:138: UserWarning: A NumPy version >=1.16.5 and <1.23.0 is required for this version of SciPy (detected version 1.23.5)
  warnings.warn(f"A NumPy version >={np_minversion} and <{np_maxversion} is required for this version of "

In [2]:
data = pd.read_csv('Данные о выводе товаров из оборота.csv')

In [3]:
outlets_manual = pd.read_csv('Справочник торговых точек.csv')

In [4]:
outlets_manual['region_code'].value_counts().head()

77    5605
50    4174
78    2624
23    2159
66    1818
Name: region_code, dtype: int64

In [5]:
outlets_manual.head()

,id_sp_,inn,region_code,city_with_type,city_fias_id,postal_code
0,C72AC534DBF5E6369840FFE9DA9FF403,0056F9FCFA009E493BEFEAE4FAA71D82,51,NaN,NaN,184421.0
1,591942644AE25AE4DD26CF943BB97414,81AAC456284F455FC2B141E6E8F1A76C,66,г Екатеринбург,2763c110-cb8b-416a-9dac-ad28a55b4402,620027.0
2,A6E2261F16F84FF09E2B615EDB008943,87C2FDB73C26C96266A0947C2BB714BF,62,г Рязань,86e5bae4-ef58-4031-b34f-5e9ff914cd55,390026.0
3,DC3B647A089FA064DE61E0C778F5EE45,87C2FDB73C26C96266A0947C2BB714BF,62,г Рязань,86e5bae4-ef58-4031-b34f-5e9ff914cd55,390017.0
4,D2F125BAA947B6293CD055DA1DEEA87D,87C2FDB73C26C96266A0947C2BB714BF,62,г Рыбное,91d71d8c-2f1a-43c8-bc84-d78dc4245a1b,391112.0

In [19]:
outlets_manual['region_code'].value_counts().head()

77    5605
50    4174
78    2624
23    2159
66    1818
Name: region_code, dtype: int64

In [20]:
outlets_manual = outlets_manual[outlets_manual['region_code'].isin([77, 50, 78])]

In [27]:
outlets_manual = outlets_manual[['inn', 'region_code']]

In [6]:
data['gtin'].value_counts().head()

1248F88441BCFC563FB99D77DB0BB80D    728678
289AEBCA82877CB19E7AA33E0E522883    350900
BB9D92ABF430CD193E3A35540D1B35CE    214463
1AF3D5B9E053CBDF908FB967FE3543AA    207795
3F2FB695D4F981545902C4700A03BEF2    205492
Name: gtin, dtype: int64

In [7]:
names = list(data['gtin'].value_counts().head().index)

In [8]:
names

['1248F88441BCFC563FB99D77DB0BB80D',
 '289AEBCA82877CB19E7AA33E0E522883',
 'BB9D92ABF430CD193E3A35540D1B35CE',
 '1AF3D5B9E053CBDF908FB967FE3543AA',
 '3F2FB695D4F981545902C4700A03BEF2']

In [9]:
data = data[data['gtin'].isin(names)]

In [30]:
data['total'] = data['price'] * data['cnt']

In [31]:
data = data[['dt', 'gtin', 'inn', 'total']]

In [10]:
data.head()

,dt,gtin,prid,inn,id_sp_,type_operation,price,cnt
155,2021-11-22,3F2FB695D4F981545902C4700A03BEF2,2DADC5DF60A9FC194A3388C1612CC967,73953DAE450DEA18AB063129C21350E6,AB0A59DAC22050D4F07D62C7A061973D,Продажа конечному потребителю в точке продаж,2571,1
163,2021-11-22,1AF3D5B9E053CBDF908FB967FE3543AA,7D1B71037D27D5597BEA1D5077663541,FA5819462A2F8CBAF8613E2E961873B9,A723252AE732FBE905ECC82B70526D94,Продажа конечному потребителю в точке продаж,23990,1
771,2022-08-08,1AF3D5B9E053CBDF908FB967FE3543AA,7D1B71037D27D5597BEA1D5077663541,25977F1E02F92D2B5AB3605B196C7ACB,B3C75C8B6310FD1903ADC950A53B7A84,Продажа конечному потребителю в точке продаж,20478,1
883,2022-08-08,1AF3D5B9E053CBDF908FB967FE3543AA,7D1B71037D27D5597BEA1D5077663541,25977F1E02F92D2B5AB3605B196C7ACB,B3C75C8B6310FD1903ADC950A53B7A84,Продажа конечному потребителю в точке продаж,27621,1
1085,2022-08-08,1AF3D5B9E053CBDF908FB967FE3543AA,7D1B71037D27D5597BEA1D5077663541,25977F1E02F92D2B5AB3605B196C7ACB,NaN,Продажа конечному потребителю в точке продаж,24989,1

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1707328 entries, 155 to 52095172
Data columns (total 8 columns):
 #   Column          Dtype
---  ------          -----
 0   dt              object
 1   gtin            object
 2   prid            object
 3   inn             object
 4   id_sp_          object
 5   type_operation  object
 6   price           int64
 7   cnt             int64
dtypes: int64(2), object(6)
memory usage: 117.2+ MB

In [34]:
outlets_manual.duplicated().sum()

10099

In [35]:
data.duplicated().sum()

1326596

In [37]:
outlets_manual = outlets_manual.drop_duplicates()

In [38]:
data = data.drop_duplicates()

In [39]:
outlets_manual.head()

                                 inn  region_code
13  82649B2629D08B79EE3543FF5804BE9D           78
19  0056F9FCFA009E493BEFEAE4FAA71D82           77
23  4BEAC3BF4F964E21BE3DD50A98A9D705           77
32  EA5DD2C8886ADFF75F7BE25BED2320E0           77
40  87C2FDB73C26C96266A0947C2BB714BF           78

In [40]:
data.head()

,dt,gtin,inn,total
155,2021-11-22,3F2FB695D4F981545902C4700A03BEF2,73953DAE450DEA18AB063129C21350E6,2571
163,2021-11-22,1AF3D5B9E053CBDF908FB967FE3543AA,FA5819462A2F8CBAF8613E2E961873B9,23990
771,2022-08-08,1AF3D5B9E053CBDF908FB967FE3543AA,25977F1E02F92D2B5AB3605B196C7ACB,20478
883,2022-08-08,1AF3D5B9E053CBDF908FB967FE3543AA,25977F1E02F92D2B5AB3605B196C7ACB,27621
1085,2022-08-08,1AF3D5B9E053CBDF908FB967FE3543AA,25977F1E02F92D2B5AB3605B196C7ACB,24989

In [41]:
data = data.merge(outlets_manual, how='inner', on='inn')

In [42]:
data.head()

,dt,gtin,inn,total,region_code
0,2022-08-08,1AF3D5B9E053CBDF908FB967FE3543AA,25977F1E02F92D2B5AB3605B196C7ACB,20478,77
1,2022-08-08,1AF3D5B9E053CBDF908FB967FE3543AA,25977F1E02F92D2B5AB3605B196C7ACB,20478,50
2,2022-08-08,1AF3D5B9E053CBDF908FB967FE3543AA,25977F1E02F92D2B5AB3605B196C7ACB,20478,78
3,2022-08-08,1AF3D5B9E053CBDF908FB967FE3543AA,25977F1E02F92D2B5AB3605B196C7ACB,27621,77
4,2022-08-08,1AF3D5B9E053CBDF908FB967FE3543AA,25977F1E02F92D2B5AB3605B196C7ACB,27621,50

In [44]:
data = data.drop('inn', axis=1)

In [45]:
data.head()

           dt                              gtin  total  region_code
0  2022-08-08  1AF3D5B9E053CBDF908FB967FE3543AA  20478           77
1  2022-08-08  1AF3D5B9E053CBDF908FB967FE3543AA  20478           50
2  2022-08-08  1AF3D5B9E053CBDF908FB967FE3543AA  20478           78
3  2022-08-08  1AF3D5B9E053CBDF908FB967FE3543AA  27621           77
4  2022-08-08  1AF3D5B9E053CBDF908FB967FE3543AA  27621           50

In [46]:
data.shape

(755788, 4)

In [51]:
data.duplicated().sum()

0

In [49]:
data = data.drop_duplicates().reset_index(drop=True)

In [50]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730612 entries, 0 to 730611
Data columns (total 4 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   dt           730612 non-null  object
 1   gtin         730612 non-null  object
 2   total        730612 non-null  int64
 3   region_code  730612 non-null  int64
dtypes: int64(2), object(2)
memory usage: 22.3+ MB

In [52]:
data.head()

           dt                              gtin  total  region_code
0  2022-08-08  1AF3D5B9E053CBDF908FB967FE3543AA  20478           77
1  2022-08-08  1AF3D5B9E053CBDF908FB967FE3543AA  20478           50
2  2022-08-08  1AF3D5B9E053CBDF908FB967FE3543AA  20478           78
3  2022-08-08  1AF3D5B9E053CBDF908FB967FE3543AA  27621           77
4  2022-08-08  1AF3D5B9E053CBDF908FB967FE3543AA  27621           50

In [53]:
data.to_csv('data.csv')